# ไม่สามารถใส่ข้อมูลที่ซ้ำกันลงไปได้ 
# ถ้าข้อมูลซ้ำกันจะไม่ถูกเก็บ เข้าไป
# set = {}   ,ข้อมูลต่างชนิดกันได้ ,แก้ไขสมาชิกข้อมูลได้ ,ข้อมูลซ้ำกันไม่ได้ ,ลำดับไม่แน่นอน
# ไม่สามารถเข้าถึงเข้ามูลแบบเจาะจงได้เพราะ ลำดับ ไม่แน่นอน


#แบบปกติ
fruit={"มะม่วง","ทุเรียน","มังคุด","ส้ม"}
print(fruit)  

#constuctor
fish=set(['ปลานิล','ปลาดุก','ปลาหมอ','ปลาช่อน'])
print(fish)

# เพิ่มข้อมูลสมาชิก สามารถเพิ่มได้แต่ไม่สามารถแก้ไขได้เพราะไม่รุ้ตำแหน่ง ต้องลบทิ้ง เท่านั้น
fish.add('ปลาตาย')
print(fish)
fish.update(fruit)  # เพิ่มหลายตัว
print(fish)

# ลบข้อมูล
fish.discard("ปลาดุก")
print(fish)